#ifndef __TTCOMMON_ERROR_H__
#define __TTCOMMON_ERROR_H__
/***************************************************************************************************
* 错误标识：	S_OK
*
* 错误描述：	调用成功
*/
#define				S_OK			0x80000003

/***************************************************************************************************
* 错误标识：	E_INVALIDARGUMENT
*
* 错误描述：	无效的参数
*/
#define E_INVALIDARGUMENT										0x80000001

/***************************************************************************************************
* 错误标识：	E_INVALID_QUEUE_HEAD
*
* 错误描述：	无效的队列头
*/
#define E_INVALID_CODEQUEUE_HEAD										0x80001000
/***************************************************************************************************
* 错误标识：	E_INVALID_QUEUE_TAIL
*
* 错误描述：	无效的队列尾
*/
#define E_INVALID_CODEQUEUE_TAIL										0x80001001
/***************************************************************************************************
* 错误标识：	E_CODE_QUEUE_NOT_INITIALIZED
*
* 错误描述：	队列未初始化
*/
#define E_CODEQUEUE_NOT_INITIALIZED										0x80001002
/***************************************************************************************************
* 错误标识：	E_CODEQUEUE_FULL
*
* 错误描述：	队列已满
*/
#define E_CODEQUEUE_FULL										0x80001003
/***************************************************************************************************
* 错误标识：	E_CODEQUEUE_EMPTY
*
* 错误描述：	队列为空
*/
#define E_CODEQUEUE_EMPTY										0x80001004
/***************************************************************************************************
* 错误标识：	E_CODEQUEUE_WRONG
*
* 错误描述：	队列损坏
*/
#define E_CODEQUEUE_WRONG										0x80001005
/***************************************************************************************************
* 错误标识：	E_CODEQUEUE_SPACE_NOT_ENOUGHT
*
* 错误描述：	队列空间不够
*/
#define E_CODEQUEUE_SPACE_NOT_ENOUGH							0x80001006
/***************************************************************************************************
* 错误标识：	E_CODEQUEUE_INVALID_PACKAGE
*
* 错误描述：	无效的数据
*/
#define E_CODEQUEUE_INVALID_PACKAGE								0x80001007

/***************************************************************************************************
* 错误标识：	E_CODEQUEUE_INVALID_PACKAGE
*
* 错误描述：	无效的数据
*/
#define E_CIRCULARBUFF_NOT_INITILIAZED								0x80002000

/***************************************************************************************************
* 错误标识：	E_CIRCULARBUFF_NOT_ENOUGH_DATA
*
* 错误描述：	数据不够
*/
#define E_CIRCULARBUFF_NOT_ENOUGH_DATA								0x80002001
/***************************************************************************************************
* 错误标识：	E_CIRCULARBUFF_WRONG
*
* 错误描述：	数据错误
*/
#define E_CIRCULARBUFF_WRONG												0x80002002
/***************************************************************************************************
* 错误标识：	E_CIRCULARBUFF_SPACE_NOT_ENOUGH
*
* 错误描述：	空间不足
*/
#define E_CIRCULARBUFF_SPACE_NOT_ENOUGH										0x80002003
#endif